import subprocess, sys
import time
i = 1
#
print("""
////////////////////////////////////////////////
// ________  ________  __    __  __  __    __ //
//|        \|        \|  \  |  \|  \|  \  |  \//
//| $$$$$$$$| $$$$$$$$| $$\ | $$ \$$| $$  | $$//
//| $$__    | $$__    | $$$\| $$|  \ \$$\/  $$//
//| $$  \   | $$  \   | $$$$\ $$| $$  >$$  $$ //
//| $$$$$   | $$$$$   | $$\$$ $$| $$ /  $$$$\ //
//| $$      | $$_____ | $$ \$$$$| $$|  $$ \$$\//
//| $$      | $$     \| $$  \$$$| $$| $$  | $$//
// \$$       \$$$$$$$$ \$$   \$$ \$$ \$$   \$$//
////////////////////////////////////////////////
""")
chose = 0
try:
    while True:
        print('\n--------------------------------------------------------')
        chose = input("Выберите версию:\n1. Терминал (старая версия)\n2. Телеграм бот (новинка)\nВыбор (цифра 1 или 2): ")
        try:
            chose = int(chose)
        except Exception:
          print("Попробуйте еще раз!")
          continue
        if (chose == 1) or (chose == 2):
            break
        else:
            print("Попробуйте еще раз!")
            continue
except:
    print("Попробуйте еще раз!")
while True:
    if i > 1:
        print(f"\n--------------------------------------------------------\nПерезапускаю fenix {i} раз")
        #print("Автоматически перезапускаю fenix...")
    time.sleep(1)
    if chose == 1:
        subprocess.call(["python", "core_test_solver_terminal_edition.py"])
    elif chose ==2:
        #print("Пока недоступно, извините!")
        subprocess.call(["python", "core_test_solver_TgBot_edition.py"])
    i += 1
